src/Reports/ПечатьСпецификации/ПечатьСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПечатьСпецификации</name>
  <attributes>
    <name>НаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсяСпецификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Этапы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьПлатыДляСБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументацияВходящихУзлов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованияSMD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Элементы</name>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасхода</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
        <types>CatalogRef.Документация</types>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ТехОперации</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Позиция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапПроизводства</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>EnumRef.ВидыДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Наборы</name>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасхода</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
        <types>CatalogRef.Документация</types>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ТехОперации</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Позиция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапПроизводства</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>EnumRef.ВидыДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

src/Enums/ТипыРиска/ТипыРиска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРиска</name>
  <enumValues>
    <name>Низкий</name>
  </enumValues>
  <enumValues>
    <name>Высокий</name>
  </enumValues>
  <enumValues>
    <name>Средний</name>
  </enumValues>
</mdclass:Enum>

src/Reports/ПечатьСпецификации/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Отчет.ВсяСпецификация = Истина;
Отчет.Аналоги = Истина;
Отчет.Этапы = Истина;
	Если Параметры.Свойство("УникальныеНомера") Тогда
	Отчет.УникальныеНомера = Параметры.УникальныеНомера;
	КонецЕсли;
		Если Параметры.Свойство("Спецификация") Тогда
			Если Параметры.Свойство("НаДату") Тогда
			Отчет.НаДату = Параметры.НаДату;
			Иначе
			Отчет.НаДату = ТекущаяДата();
			КонецЕсли; 
		Отчет.Спецификация = Параметры.Спецификация;
		ЭтаФорма.Заголовок = "Спецификация "+СокрЛП(Отчет.Спецификация.Наименование);
			Если Параметры.Свойство("ВсяСпецификация") Тогда
			Отчет.ВсяСпецификация = Параметры.ВсяСпецификация;
			КонецЕсли;
				Если Параметры.Свойство("ДляSMD") Тогда
				Отчет.НаименованияSMD = Параметры.ДляSMD;
				КонецЕсли; 
		СформироватьНаСервере(Отчет.Спецификация,ТабДок);
		ИначеЕсли Параметры.Свойство("ПЗ") Тогда 
		Отчет.НаДату = Параметры.ПЗ.ДатаЗапуска;
		Отчет.Спецификация = Параметры.ПЗ.Изделие;
		ЭтаФорма.Заголовок = "Спецификация "+СокрЛП(Отчет.Спецификация.Наименование);	
		СформироватьНаСервере(Отчет.Спецификация,ТабДок);
		Иначе
		Отчет.НаДату = ТекущаяДата();
		КонецЕсли; 		
КонецПроцедуры

&НаСервере
Функция СортироватьПоПорядку(ТекЗнач) 
	Если (ТекЗнач = "")или(Найти(ТекЗнач,"-") > 0) Тогда
	Возврат(ТекЗнач);		
	КонецЕсли;
ТемпКон = "";
	Для к = 1 по 3 Цикл
		Если (КодСимвола(Сред(ТекЗнач,к,1)) > 47)и(КодСимвола(Сред(ТекЗнач,к,1)) < 58) Тогда
		ТемпНач = Лев(ТекЗнач,к-1);
		ТекЗнач = СтрЗаменить(ТекЗнач,ТемпНач,"");
			Если Найти(ТекЗнач,".") > 0 Тогда
			ТемпКон = Сред(ТекЗнач,Найти(ТекЗнач,"."));
			ТекЗнач = СтрЗаменить(ТекЗнач,ТемпКон,"");
			КонецЕсли;	                            
		    	Пока СтрДлина(ТекЗнач) < 5 Цикл
		    	ТекЗнач = "#"+ТекЗнач;	
				КонецЦикла;		
		Возврат(СокрЛП(ТемпНач+ТекЗнач+ТемпКон));		
		КонецЕсли;
	КонецЦикла;
Возврат(СокрЛП(ТекЗнач));	
КонецФункции

&НаСервере
Процедура РаскрытьНаМПЗ(ВыбСпецификация,КолМПЗ,ТЗ)
НормРасх = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Все(ВыбСпецификация,КонецДня(Отчет.НаДату));
	Пока НормРасх.Следующий() Цикл				
		Если ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Номенклатура") Тогда
			Если НормРасх.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Набор Тогда
			ТЧ = ТЗ.Добавить();	
			ТЧ.Раздел = "6Комплекты";
			ТЧ.НормаРасхода = НормРасх.Ссылка;
			ТЧ.Элемент = НормРасх.Элемент;
			ТЧ.Позиция = СортироватьПоПорядку(СокрЛП(НормРасх.Позиция));
			ТЧ.ЭтапПроизводства = ПолучитьПрефиксЭтапаПроизводства(ВыбСпецификация.Родитель);
            ТЧ.Количество = НормРасх.Норма*КолМПЗ;
			ТЧ.ЕдиницаИзмерения = НормРасх.Элемент.ОсновнаяЕдиницаИзмерения;	
			ТЧ.Примечание = СокрЛП(НормРасх.Примечание);
			ТЧ.Коэффициент = КолМПЗ;
			ИначеЕсли НормРасх.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Основа Тогда
				Если Отчет.ВсяСпецификация Тогда
				РаскрытьНаМПЗ(НормРасх.Элемент,ПолучитьБазовоеКоличество(НормРасх.Норма,НормРасх.Элемент.ОсновнаяЕдиницаИзмерения)*КолМПЗ,ТЗ);
				Иначе
				ТЧ = ТЗ.Добавить();	
				ТЧ.Раздел = "2Сборочные единицы";
				ТЧ.НормаРасхода = НормРасх.Ссылка;
				ТЧ.Элемент = НормРасх.Элемент;
				ТЧ.Позиция = СортироватьПоПорядку(СокрЛП(НормРасх.Позиция));
				ТЧ.ЭтапПроизводства = ПолучитьПрефиксЭтапаПроизводства(ВыбСпецификация.Родитель);
	            ТЧ.Количество = НормРасх.Норма*КолМПЗ;			
				ТЧ.ЕдиницаИзмерения = НормРасх.Элемент.ОсновнаяЕдиницаИзмерения;
				ТЧ.Примечание = СокрЛП(НормРасх.Примечание);
				ТЧ.Коэффициент = КолМПЗ;				
				КонецЕсли;
			ИначеЕсли НормРасх.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Деталь Тогда
			ТЧ = ТЗ.Добавить();	
			ТЧ.Раздел = "3Детали";
			ТЧ.НормаРасхода = НормРасх.Ссылка;
			ТЧ.Элемент = НормРасх.Элемент;
			ТЧ.Позиция = СортироватьПоПорядку(СокрЛП(НормРасх.Позиция));
			ТЧ.ЭтапПроизводства = ПолучитьПрефиксЭтапаПроизводства(ВыбСпецификация.Родитель);
            ТЧ.Количество = НормРасх.Норма*КолМПЗ;		
			ТЧ.ЕдиницаИзмерения = НормРасх.Элемент.ОсновнаяЕдиницаИзмерения;
			ТЧ.Примечание = СокрЛП(НормРасх.Примечание);
			ТЧ.Коэффициент = КолМПЗ;
			Иначе
			ТЧ = ТЗ.Добавить();	
			ТЧ.Раздел = "2Сборочные единицы";
			ТЧ.НормаРасхода = НормРасх.Ссылка;
			ТЧ.Элемент = НормРасх.Элемент;
			ТЧ.Позиция = СортироватьПоПорядку(СокрЛП(НормРасх.Позиция));
			ТЧ.ЭтапПроизводства = ПолучитьПрефиксЭтапаПроизводства(ВыбСпецификация.Родитель);
            ТЧ.Количество = НормРасх.Норма*КолМПЗ;			
			ТЧ.ЕдиницаИзмерения = НормРасх.Элемент.ОсновнаяЕдиницаИзмерения;
			ТЧ.Примечание = СокрЛП(НормРасх.Примечание);
			ТЧ.Коэффициент = КолМПЗ;
			КонецЕсли;
		ИначеЕсли ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
		ТЧ = ТЗ.Добавить();	
		ТЧ.Раздел = "4"+СокрЛП(ПолучитьВерхнегоРодителя(НормРасх.Элемент));
		ТЧ.НормаРасхода = НормРасх.Ссылка;
		ТЧ.Элемент = НормРасх.Элемент;
		ТЧ.Позиция = СортироватьПоПорядку(СокрЛП(НормРасх.Позиция));
		ТЧ.ЭтапПроизводства = ПолучитьПрефиксЭтапаПроизводства(ВыбСпецификация.Родитель);
        ТЧ.Количество = НормРасх.Норма*КолМПЗ;
		ТЧ.ЕдиницаИзмерения = НормРасх.Элемент.ОсновнаяЕдиницаИзмерения;				
		ТЧ.Примечание = СокрЛП(НормРасх.Примечание);
		ТЧ.Коэффициент = КолМПЗ;
		ИначеЕсли ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Документация") Тогда
		ТЧ = ТЗ.Добавить();	
		ТЧ.Раздел = "1Документация";
		ТЧ.НормаРасхода = НормРасх.Ссылка;
		ТЧ.ВидДокумента = НормРасх.Элемент.ВидДокумента;
		ТЧ.Элемент = НормРасх.Элемент;
		ТЧ.Позиция = СортироватьПоПорядку(СокрЛП(НормРасх.Позиция));
		ТЧ.ЭтапПроизводства = ПолучитьПрефиксЭтапаПроизводства(ВыбСпецификация.Родитель);
		ТЧ.Примечание = СокрЛП(НормРасх.Элемент.ИмяФайла);
		ИначеЕсли ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.ТехОснастка") Тогда
		ТЧ = ТЗ.Добавить();	
		ТЧ.Раздел = "5Технологическая оснастка";
		ТЧ.НормаРасхода = НормРасх.Ссылка;
		ТЧ.Элемент = НормРасх.Элемент;
		ТЧ.ЭтапПроизводства = ПолучитьПрефиксЭтапаПроизводства(ВыбСпецификация.Родитель);
		ТЧ.Количество = НормРасх.Норма*КолМПЗ;
		ТЧ.Примечание = СокрЛП(НормРасх.Элемент.ИмяФайла);		
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере(ЭтапСпецификации,ТД)
ТД.Очистить();	
Макет = Отчеты.ПечатьСпецификации.ПолучитьМакет("Спецификация"); 
ДатаИзм = ЭтапСпецификации.ДатаСозданияСпецификации;
ДатаПоследнегоИзменения = Формат(ОбщийМодульВызовСервера.ОпределитьДатуПоследнегоИзменения(ЭтапСпецификации,Отчет.ВсяСпецификация,Отчет.НаДату,ДатаИзм),"ДФ=dd.MM.yyyy");
	Если Отчет.Этапы Тогда
	ОблШапкаСпецификацияЭтап = Макет.ПолучитьОбласть("Шапка|СпецифЭтап");	
	ОблШапкаСпецификацияЭтап.Параметры.Спецификация = СокрЛП(ЭтапСпецификации.Наименование);
	ОблШапкаСпецификацияЭтап.Параметры.Статус = ПолучитьСтатус(ЭтапСпецификации);
	ОблШапкаСпецификацияЭтап.Параметры.НаДату = Формат(Отчет.НаДату,"ДФ=dd.MM.yyyy");
	ОблШапкаСпецификацияЭтап.Параметры.ДатаСоздания = Формат(ЭтапСпецификации.ДатаСозданияСпецификации,"ДФ=dd.MM.yyyy");
	ОблШапкаСпецификацияЭтап.Параметры.ДатаИзменения = ДатаПоследнегоИзменения;
	ОблШапкаСпецификацияЭтап.Параметры.ДатаВывода = ТекущаяДата();
	ТД.Вывести(ОблШапкаСпецификацияЭтап);
	Иначе
	ОблШапкаСпецификация = Макет.ПолучитьОбласть("Шапка|Специф");
	ОблШапкаСпецификация.Параметры.Спецификация = СокрЛП(ЭтапСпецификации.Наименование);
	ОблШапкаСпецификация.Параметры.Статус = ПолучитьСтатус(ЭтапСпецификации);	
	ОблШапкаСпецификация.Параметры.ДатаСоздания = Формат(ЭтапСпецификации.ДатаСозданияСпецификации,"ДФ=dd.MM.yyyy");
	ОблШапкаСпецификация.Параметры.ДатаИзменения = ДатаПоследнегоИзменения;
	ОблШапкаСпецификация.Параметры.ДатаВывода = ТекущаяДата();	
	ТД.Вывести(ОблШапкаСпецификация);
	КонецЕсли;
		Если Отчет.УникальныеНомера Тогда
		МестоХранения = Справочники.МестаХранения.НайтиПоНаименованию("SMD Комплектация",Истина);
		ОблШапкаУН = Макет.ПолучитьОбласть("Шапка|УникальныеНомера");	
		ТД.Присоединить(ОблШапкаУН);
		КонецЕсли;
Отчет.Элементы.Очистить();
РаскрытьНаМПЗ(ЭтапСпецификации,1,Отчет.Элементы);
Отчет.Элементы.Сортировать("Раздел,Позиция,Элемент");
	Если Отчет.Этапы Тогда
	ОблГруппа = Макет.ПолучитьОбласть("Группа|СпецифЭтап");	
	ОблСтрока = Макет.ПолучитьОбласть("Строка|СпецифЭтап");	
	ОблАналог = Макет.ПолучитьОбласть("Аналоги|СпецифЭтап");
	ОблНабор = Макет.ПолучитьОбласть("Набор|СпецифЭтап");
	ОблПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока|СпецифЭтап");
	ОблКонец = Макет.ПолучитьОбласть("Конец|СпецифЭтап");
	Иначе
	ОблГруппа = Макет.ПолучитьОбласть("Группа|Специф");	
	ОблСтрока = Макет.ПолучитьОбласть("Строка|Специф");	
	ОблАналог = Макет.ПолучитьОбласть("Аналоги|Специф");
	ОблНабор = Макет.ПолучитьОбласть("Набор|Специф");
	ОблПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока|Специф");
	ОблКонец = Макет.ПолучитьОбласть("Конец|Специф");
	КонецЕсли;
		Если Отчет.УникальныеНомера Тогда
		ОблГруппаУН = Макет.ПолучитьОбласть("Группа|УникальныеНомера");	
		ОблСтрокаУН = Макет.ПолучитьОбласть("Строка|УникальныеНомера");	
		ОблАналогУН = Макет.ПолучитьОбласть("Аналоги|УникальныеНомера");
		ОблНаборУН = Макет.ПолучитьОбласть("Набор|УникальныеНомера");
		ОблПустаяСтрокаУН = Макет.ПолучитьОбласть("ПустаяСтрока|УникальныеНомера");
		ОблКонецУН = Макет.ПолучитьОбласть("Конец|УникальныеНомера");
		КонецЕсли; 
ТекРаздел = "";
	Для Каждого СтрокаТЗ Из Отчет.Элементы Цикл
	ОблСтрока.Параметры.ЕдИзм = "";
	ОблСтрока.Параметры.Кол = "";
		Если ТекРаздел <> СтрокаТЗ.Раздел Тогда
		ОблГруппа.Параметры.Группа = Сред(СтрокаТЗ.Раздел,2);	
		ТекРаздел = СтрокаТЗ.Раздел;
		ТД.Вывести(ОблГруппа);
			Если Отчет.УникальныеНомера Тогда	
			ТД.Присоединить(ОблГруппаУН);
			КонецЕсли;		
		КонецЕсли;
			Если ТекРаздел = "6Комплекты" Тогда
			ОблНабор.Параметры.Группа = СокрЛП(СтрокаТЗ.Элемент);
			ОблНабор.Параметры.Статус = ПолучитьСтатус(СтрокаТЗ.Элемент);
				Если Отчет.Этапы Тогда
				ОблНабор.Параметры.Этап = СтрокаТЗ.ЭтапПроизводства;
				КонецЕсли;
			ТД.Вывести(ОблПустаяСтрока);
				Если Отчет.УникальныеНомера Тогда	
				ТД.Присоединить(ОблПустаяСтрокаУН);
				КонецЕсли;			
			ТД.Вывести(ОблНабор);
				Если Отчет.УникальныеНомера Тогда	
				ТД.Присоединить(ОблНаборУН);
				КонецЕсли;			
			ТД.НачатьГруппуСтрок(СокрЛП(СтрокаТЗ.Элемент), Истина);
			Отчет.Наборы.Очистить();
			РаскрытьНаМПЗ(СтрокаТЗ.Элемент,1,Отчет.Наборы);
			Отчет.Наборы.Сортировать("Раздел,Позиция,Элемент");
			ТекРазделНабор = "";
				Для Каждого СтрокаТЗНабор Из Отчет.Наборы Цикл
				ОблСтрока.Параметры.ЕдИзм = "";
				ОблСтрока.Параметры.Кол = "";
					Если ТекРазделНабор <> СтрокаТЗНабор.Раздел Тогда
					ОблГруппа.Параметры.Группа = Сред(СтрокаТЗНабор.Раздел,2);
					ТекРазделНабор = СтрокаТЗНабор.Раздел;
					ТД.Вывести(ОблГруппа);
						Если Отчет.УникальныеНомера Тогда	
						ТД.Присоединить(ОблГруппаУН);
						КонецЕсли;					
					КонецЕсли;					
				ОблСтрока.Параметры.Статус = ПолучитьСтатус(СтрокаТЗНабор.Элемент);
				ОблСтрока.Параметры.Позиция = СокрЛП(СтрокаТЗНабор.НормаРасхода.Позиция);
				ОблСтрока.Параметры.ВидДок = СтрокаТЗНабор.ВидДокумента;
					Если Отчет.НаименованияSMD Тогда
						Если ТипЗнч(СтрокаТЗНабор.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
						ОблСтрока.Параметры.Наимен = СокрЛП(СтрокаТЗНабор.Элемент.НаименованиеSMD);
						Иначе	
						ОблСтрока.Параметры.Наимен = СокрЛП(СтрокаТЗНабор.Элемент.Наименование);
						КонецЕсли;					
					Иначе	
					ОблСтрока.Параметры.Наимен = СокрЛП(СтрокаТЗНабор.Элемент.Наименование);
					КонецЕсли;
				ОблСтрока.Параметры.Элемент = СтрокаТЗНабор.Элемент;
					Если СтрокаТЗНабор.Количество > 0 Тогда
					ОблСтрока.Параметры.Кол = СтрокаТЗНабор.Количество;
					КонецЕсли;
				ЕдИзм = СокрЛП(СтрокаТЗНабор.ЕдиницаИзмерения.Наименование);			
					Если ЕдИзм <> "шт" Тогда
					ОблСтрока.Параметры.ЕдИзм = ЕдИзм;
					Иначе
					ОблСтрока.Параметры.ЕдИзм = "";
					КонецЕсли;
				ОблСтрока.Параметры.Примечание = СокрЛП(СтрокаТЗНабор.Примечание);	
					Если Отчет.Этапы Тогда
					ОблСтрока.Параметры.Этап = СтрокаТЗНабор.ЭтапПроизводства;
					КонецЕсли;
				ТекОбл = ТД.Вывести(ОблСтрока);
					Если ТипЗнч(СтрокаТЗНабор.Элемент) = Тип("СправочникСсылка.Материалы") Тогда 
						Если Не СтрокаТЗНабор.Элемент.ТипРиска.Пустая() Тогда
							Если Отчет.Этапы Тогда
							ТД.Область(ТекОбл.Верх, 4, ТекОбл.Низ, 4).ЦветТекста = ?(СтрокаТЗНабор.Элемент.ТипРиска = Перечисления.ТипыРиска.Низкий,WEBЦвета.Синий,WEBЦвета.Красный);
							Иначе	
							ТД.Область(ТекОбл.Верх, 3, ТекОбл.Низ, 3).ЦветТекста = ?(СтрокаТЗНабор.Элемент.ТипРиска = Перечисления.ТипыРиска.Низкий,WEBЦвета.Синий,WEBЦвета.Красный);							
							КонецЕсли;
						КонецЕсли;		
					КонецЕсли;
					Если Отчет.УникальныеНомера Тогда
					ЯХ = ОбщийМодульРаботаСРегистрами.ПолучитьЯчейкуХранения(СтрокаТЗНабор.Элемент,МестоХранения);
						Если ЯХ <> Неопределено Тогда	
						ОблСтрокаУН.Параметры.УникальныйНомер = ЯХ.УникальныйНомер;
						Иначе
						ОблСтрокаУН.Параметры.УникальныйНомер = "";
						КонецЕсли; 
					ТД.Присоединить(ОблСтрокаУН);
					КонецЕсли;				
						Если Отчет.Аналоги Тогда
							Если (ТипЗнч(СтрокаТЗНабор.Элемент) = Тип("СправочникСсылка.Материалы"))или
								 (ТипЗнч(СтрокаТЗНабор.Элемент) = Тип("СправочникСсылка.Номенклатура"))Тогда 
							ТаблицаАналогов = ОбщегоНазначенияПовтИсп.ПолучитьАналогиНормРасходов(СтрокаТЗНабор.НормаРасхода,КонецДня(Отчет.НаДату),Истина);
								Для каждого ТЧ_ТА Из ТаблицаАналогов Цикл
								ОблАналог.Параметры.Статус = ПолучитьСтатус(ТЧ_ТА.Элемент);
									Если Отчет.НаименованияSMD Тогда
										Если ТипЗнч(ТЧ_ТА.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
										ОблАналог.Параметры.НаименАналог = СокрЛП(ТЧ_ТА.Элемент.НаименованиеSMD);
										Иначе	
										ОблАналог.Параметры.НаименАналог = СокрЛП(ТЧ_ТА.Элемент.Наименование);
										КонецЕсли;					
									Иначе	
									ОблАналог.Параметры.НаименАналог = СокрЛП(ТЧ_ТА.Элемент.Наименование);
									КонецЕсли;
								ОблАналог.Параметры.Аналог = ТЧ_ТА.Элемент;					
								ОблАналог.Параметры.Кол = ТЧ_ТА.Норма*СтрокаТЗНабор.Коэффициент;
								ЕдИзм = СокрЛП(ТЧ_ТА.Элемент.ОсновнаяЕдиницаИзмерения.Наименование);
									Если ЕдИзм <> "шт" Тогда
									ОблАналог.Параметры.ЕдИзм = ЕдИзм;
									Иначе
									ОблАналог.Параметры.ЕдИзм = "";
									КонецЕсли;
								ТекОбл = ТД.Вывести(ОблАналог);
									Если ТипЗнч(ТЧ_ТА.Элемент) = Тип("СправочникСсылка.Материалы") Тогда 
										Если Не ТЧ_ТА.Элемент.ТипРиска.Пустая() Тогда
											Если Отчет.Этапы Тогда
											ТД.Область(ТекОбл.Верх, 4, ТекОбл.Низ, 4).ЦветТекста = ?(ТЧ_ТА.Элемент.ТипРиска = Перечисления.ТипыРиска.Низкий,WEBЦвета.Синий,WEBЦвета.Красный);
											Иначе	
											ТД.Область(ТекОбл.Верх, 3, ТекОбл.Низ, 3).ЦветТекста = ?(ТЧ_ТА.Элемент.ТипРиска = Перечисления.ТипыРиска.Низкий,WEBЦвета.Синий,WEBЦвета.Красный);							
											КонецЕсли;
										КонецЕсли; 
									КонецЕсли;
									Если Отчет.УникальныеНомера Тогда
									ЯХ = ОбщийМодульРаботаСРегистрами.ПолучитьЯчейкуХранения(ТЧ_ТА.Элемент,МестоХранения);
										Если ЯХ <> Неопределено Тогда	
										ОблАналогУН.Параметры.УникальныйНомер = ЯХ.УникальныйНомер;
										Иначе
										ОблАналогУН.Параметры.УникальныйНомер = "";
										КонецЕсли; 
									ТД.Присоединить(ОблАналогУН);
									КонецЕсли;							
								КонецЦикла;
							КонецЕсли;
						КонецЕсли;	
				КонецЦикла;
			ТД.ЗакончитьГруппуСтрок();	
			Иначе
			ОблСтрока.Параметры.Статус = ПолучитьСтатус(СтрокаТЗ.Элемент);
			ОблСтрока.Параметры.Позиция = СокрЛП(СтрокаТЗ.НормаРасхода.Позиция);
			ОблСтрока.Параметры.ВидДок = СтрокаТЗ.ВидДокумента;
				Если Отчет.НаименованияSMD Тогда
					Если ТипЗнч(СтрокаТЗ.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
					ОблСтрока.Параметры.Наимен = СокрЛП(СтрокаТЗ.Элемент.НаименованиеSMD);
					Иначе	
					ОблСтрока.Параметры.Наимен = СокрЛП(СтрокаТЗ.Элемент.Наименование);
					КонецЕсли;					
				Иначе	
				ОблСтрока.Параметры.Наимен = СокрЛП(СтрокаТЗ.Элемент.Наименование);
				КонецЕсли;
			ОблСтрока.Параметры.Элемент = СтрокаТЗ.Элемент;
				Если СтрокаТЗ.Количество > 0 Тогда
				ОблСтрока.Параметры.Кол = СтрокаТЗ.Количество;
				КонецЕсли;			
			ЕдИзм = СокрЛП(СтрокаТЗ.ЕдиницаИзмерения.Наименование);			
				Если ЕдИзм <> "шт" Тогда
				ОблСтрока.Параметры.ЕдИзм = ЕдИзм;
				Иначе
				ОблСтрока.Параметры.ЕдИзм = "";
				КонецЕсли;
			ОблСтрока.Параметры.Примечание = СокрЛП(СтрокаТЗ.Примечание);	
				Если Отчет.Этапы Тогда
				ОблСтрока.Параметры.Этап = СтрокаТЗ.ЭтапПроизводства;
				КонецЕсли;
			ТекОбл = ТД.Вывести(ОблСтрока);
				Если ТипЗнч(СтрокаТЗ.Элемент) = Тип("СправочникСсылка.Материалы") Тогда 
					Если Не СтрокаТЗ.Элемент.ТипРиска.Пустая() Тогда
						Если Отчет.Этапы Тогда
						ТД.Область(ТекОбл.Верх, 4, ТекОбл.Низ, 4).ЦветТекста = ?(СтрокаТЗ.Элемент.ТипРиска = Перечисления.ТипыРиска.Низкий,WEBЦвета.Синий,WEBЦвета.Красный);
						Иначе	
						ТД.Область(ТекОбл.Верх, 3, ТекОбл.Низ, 3).ЦветТекста = ?(СтрокаТЗ.Элемент.ТипРиска = Перечисления.ТипыРиска.Низкий,WEBЦвета.Синий,WEBЦвета.Красный);							
						КонецЕсли;
					КонецЕсли; 
				КонецЕсли;
				Если Отчет.УникальныеНомера Тогда
				ЯХ = ОбщийМодульРаботаСРегистрами.ПолучитьЯчейкуХранения(СтрокаТЗ.Элемент,МестоХранения);
					Если ЯХ <> Неопределено Тогда	
					ОблСтрокаУН.Параметры.УникальныйНомер = ЯХ.УникальныйНомер;
					Иначе
					ОблСтрокаУН.Параметры.УникальныйНомер = "";
					КонецЕсли; 
				ТД.Присоединить(ОблСтрокаУН);
				КонецЕсли;			
					Если Отчет.Аналоги Тогда
						Если (ТипЗнч(СтрокаТЗ.Элемент) = Тип("СправочникСсылка.Материалы"))или
							 (ТипЗнч(СтрокаТЗ.Элемент) = Тип("СправочникСсылка.Номенклатура"))Тогда
						ТаблицаАналогов = ОбщегоНазначенияПовтИсп.ПолучитьАналогиНормРасходов(СтрокаТЗ.НормаРасхода,КонецДня(Отчет.НаДату),Истина);
							Для каждого ТЧ_ТА Из ТаблицаАналогов Цикл
							ОблАналог.Параметры.Статус = ПолучитьСтатус(ТЧ_ТА.Элемент);
								Если Отчет.НаименованияSMD Тогда
									Если ТипЗнч(ТЧ_ТА.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
									ОблАналог.Параметры.НаименАналог = СокрЛП(ТЧ_ТА.Элемент.НаименованиеSMD);
									Иначе	
									ОблАналог.Параметры.НаименАналог = СокрЛП(ТЧ_ТА.Элемент.Наименование);
									КонецЕсли;					
								Иначе	
								ОблАналог.Параметры.НаименАналог = СокрЛП(ТЧ_ТА.Элемент.Наименование);
								КонецЕсли;
							ОблАналог.Параметры.Аналог = ТЧ_ТА.Элемент;					
							ОблАналог.Параметры.Кол = ТЧ_ТА.Норма*СтрокаТЗ.Коэффициент;
							ЕдИзм = СокрЛП(ТЧ_ТА.Элемент.ОсновнаяЕдиницаИзмерения.Наименование);
								Если ЕдИзм <> "шт" Тогда
								ОблАналог.Параметры.ЕдИзм = ЕдИзм;
								Иначе
								ОблАналог.Параметры.ЕдИзм = "";
								КонецЕсли;
							ТекОбл = ТД.Вывести(ОблАналог);
								Если ТипЗнч(ТЧ_ТА.Элемент) = Тип("СправочникСсылка.Материалы") Тогда 
									Если Не ТЧ_ТА.Элемент.ТипРиска.Пустая() Тогда
										Если Отчет.Этапы Тогда
										ТД.Область(ТекОбл.Верх, 4, ТекОбл.Низ, 4).ЦветТекста = ?(ТЧ_ТА.Элемент.ТипРиска = Перечисления.ТипыРиска.Низкий,WEBЦвета.Синий,WEBЦвета.Красный);
										Иначе	
										ТД.Область(ТекОбл.Верх, 3, ТекОбл.Низ, 3).ЦветТекста = ?(ТЧ_ТА.Элемент.ТипРиска = Перечисления.ТипыРиска.Низкий,WEBЦвета.Синий,WEBЦвета.Красный);							
										КонецЕсли;
									КонецЕсли; 
								КонецЕсли;
								Если Отчет.УникальныеНомера Тогда
								ЯХ = ОбщийМодульРаботаСРегистрами.ПолучитьЯчейкуХранения(ТЧ_ТА.Элемент,МестоХранения);
									Если ЯХ <> Неопределено Тогда	
									ОблАналогУН.Параметры.УникальныйНомер = ЯХ.УникальныйНомер;
									Иначе
									ОблАналогУН.Параметры.УникальныйНомер = "";
									КонецЕсли; 
								ТД.Присоединить(ОблАналогУН);
								КонецЕсли;						
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
			КонецЕсли;	
	КонецЦикла;
ТД.Вывести(ОблКонец);
	Если Отчет.УникальныеНомера Тогда	
	ТД.Присоединить(ОблКонецУН);
	КонецЕсли;
ТД.РазмерСтраницы = "A4";
ТД.ПолеСлева = 0;
ТД.ПолеСверху = 0;
ТД.ПолеСнизу = 0;
ТД.ПолеСправа = 0;
ТД.РазмерКолонтитулаСверху = 0;
ТД.РазмерКолонтитулаСнизу = 0;
ТД.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
ТД.ФиксацияСверху = 3;
ТД.ЧерноБелаяПечать = Истина;
Возврат(ТД);
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
ЭтаФорма.Заголовок = "Спецификация "+СокрЛП(Отчет.Спецификация);
СформироватьНаСервере(Отчет.Спецификация,ТабДок);
КонецПроцедуры

&НаСервере
Функция ПолучитьДокумент(Элемент)
Возврат(Элемент.ИмяФайла);
КонецФункции

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Документация") Тогда
	СтандартнаяОбработка = Ложь;
	ОбщийМодульКлиент.ОткрытьФайлДокумента(Расшифровка);
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Материалы") Тогда
	СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(ПолучитьДокумент(Расшифровка)) Тогда
		ЗапуститьПриложение(ОбщийМодульВызовСервера.ПолучитьФайлДокумента(ПолучитьДокумент(Расшифровка)));
		Иначе
		Сообщить("Файл не прикреплен!");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("СправочникСсылка.ТехОснастка") Тогда
	СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(ПолучитьДокумент(Расшифровка)) Тогда
		ЗапуститьПриложение(ОбщийМодульВызовСервера.ПолучитьФайлДокумента(ПолучитьДокумент(Расшифровка)));
		Иначе
		Сообщить("Файл не прикреплен!");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Номенклатура") Тогда
	СтандартнаяОбработка = Ложь;
	П = Новый Структура("Спецификация,НаДату",Расшифровка,Отчет.НаДату);
	ОткрытьФорму("Отчет.ПечатьСпецификации.Форма.ФормаОтчета",П);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КлючУникальности = Новый УникальныйИдентификатор();
КонецПроцедуры
